MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK02FN64VLH10/mcu.h
#define ADC0_SC1A                     (*((volatile uint32_t *)0x4003B000))      // ADC Status and Control Registers 1 (ADC0_SC1A)
#define ADC0_SC1B                     (*((volatile uint32_t *)0x4003B004))      // ADC Status and Control Registers 1 (ADC0_SC1B)
#define ADC0_CFG1                     (*((volatile uint32_t *)0x4003B008))      // ADC Configuration Register 1 (ADC0_CFG1)
#define ADC0_CFG2                     (*((volatile uint32_t *)0x4003B00C))      // ADC Configuration Register 2 (ADC0_CFG2)
#define ADC0_RA                       (*((volatile uint32_t *)0x4003B010))      // ADC Data Result Register (ADC0_RA)
#define ADC0_RB                       (*((volatile uint32_t *)0x4003B014))      // ADC Data Result Register (ADC0_RB)
#define ADC0_CV1                      (*((volatile uint32_t *)0x4003B018))      // Compare Value Registers (ADC0_CV1)
#define ADC0_CV2                      (*((volatile uint32_t *)0x4003B01C))      // Compare Value Registers (ADC0_CV2)
#define ADC0_SC2                      (*((volatile uint32_t *)0x4003B020))      // Status and Control Register 2 (ADC0_SC2)
#define ADC0_SC3                      (*((volatile uint32_t *)0x4003B024))      // Status and Control Register 3 (ADC0_SC3)
#define ADC0_OFS                      (*((volatile uint32_t *)0x4003B028))      // ADC Offset Correction Register (ADC0_OFS)
#define ADC0_PG                       (*((volatile uint32_t *)0x4003B02C))      // ADC Plus-Side Gain Register (ADC0_PG)
#define ADC0_MG                       (*((volatile uint32_t *)0x4003B030))      // ADC Minus-Side Gain Register (ADC0_MG)
#define ADC0_CLPD                     (*((volatile uint32_t *)0x4003B034))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPD)
#define ADC0_CLPS                     (*((volatile uint32_t *)0x4003B038))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPS)
#define ADC0_CLP4                     (*((volatile uint32_t *)0x4003B03C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP4)
#define ADC0_CLP3                     (*((volatile uint32_t *)0x4003B040))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP3)
#define ADC0_CLP2                     (*((volatile uint32_t *)0x4003B044))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP2)
#define ADC0_CLP1                     (*((volatile uint32_t *)0x4003B048))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP1)
#define ADC0_CLP0                     (*((volatile uint32_t *)0x4003B04C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP0)
#define ADC0_CLMD                     (*((volatile uint32_t *)0x4003B054))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMD)
#define ADC0_CLMS                     (*((volatile uint32_t *)0x4003B058))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMS)
#define ADC0_CLM4                     (*((volatile uint32_t *)0x4003B05C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM4)
#define ADC0_CLM3                     (*((volatile uint32_t *)0x4003B060))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM3)
#define ADC0_CLM2                     (*((volatile uint32_t *)0x4003B064))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM2)
#define ADC0_CLM1                     (*((volatile uint32_t *)0x4003B068))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM1)
#define ADC0_CLM0                     (*((volatile uint32_t *)0x4003B06C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM0)


//*****************************************************************************
//
// Comparator (CMP) registers
//
//*****************************************************************************

#define CMP0_CR0                      (*((volatile uint32_t *)0x40073000))      // CMP Control Register 0 (CMP0_CR0)
#define CMP0_CR1                      (*((volatile uint32_t *)0x40073001))      // CMP Control Register 1 (CMP0_CR1)
#define CMP0_FPR                      (*((volatile uint32_t *)0x40073002))      // CMP Filter Period Register (CMP0_FPR)
#define CMP0_SCR                      (*((volatile uint32_t *)0x40073003))      // CMP Status and Control Register (CMP0_SCR)
#define CMP0_DACCR                    (*((volatile uint32_t *)0x40073004))      // DAC Control Register (CMP0_DACCR)
#define CMP0_MUXCR                    (*((volatile uint32_t *)0x40073005))      // MUX Control Register (CMP0_MUXCR)
#define CMP1_CR0                      (*((volatile uint32_t *)0x40073008))      // CMP Control Register 0 (CMP1_CR0)
#define CMP1_CR1                      (*((volatile uint32_t *)0x40073009))      // CMP Control Register 1 (CMP1_CR1)
#define CMP1_FPR                      (*((volatile uint32_t *)0x4007300A))      // CMP Filter Period Register (CMP1_FPR)
#define CMP1_SCR                      (*((volatile uint32_t *)0x4007300B))      // CMP Status and Control Register (CMP1_SCR)
#define CMP1_DACCR                    (*((volatile uint32_t *)0x4007300C))      // DAC Control Register (CMP1_DACCR)
#define CMP1_MUXCR                    (*((volatile uint32_t *)0x4007300D))      // MUX Control Register (CMP1_MUXCR)


//*****************************************************************************
//
// 12-bit Digital-to-Analog Converter (DAC) registers
//
//*****************************************************************************

#define DAC0_DAT0L                    (*((volatile uint32_t *)0x4003F000))      // DAC Data Low Register (DAC0_DAT0L)
#define DAC0_DAT0H                    (*((volatile uint32_t *)0x4003F001))      // DAC Data High Register (DAC0_DAT0H)
#define DAC0_DAT1L                    (*((volatile uint32_t *)0x4003F002))      // DAC Data Low Register (DAC0_DAT1L)
#define DAC0_DAT1H                    (*((volatile uint32_t *)0x4003F003))      // DAC Data High Register (DAC0_DAT1H)
#define DAC0_DAT2L                    (*((volatile uint32_t *)0x4003F004))      // DAC Data Low Register (DAC0_DAT2L)
#define DAC0_DAT2H                    (*((volatile uint32_t *)0x4003F005))      // DAC Data High Register (DAC0_DAT2H)
#define DAC0_DAT3L                    (*((volatile uint32_t *)0x4003F006))      // DAC Data Low Register (DAC0_DAT3L)
#define DAC0_DAT3H                    (*((volatile uint32_t *)0x4003F007))      // DAC Data High Register (DAC0_DAT3H)
#define DAC0_DAT4L                    (*((volatile uint32_t *)0x4003F008))      // DAC Data Low Register (DAC0_DAT4L)
#define DAC0_DAT4H                    (*((volatile uint32_t *)0x4003F009))      // DAC Data High Register (DAC0_DAT4H)
#define DAC0_DAT5L                    (*((volatile uint32_t *)0x4003F00A))      // DAC Data Low Register (DAC0_DAT5L)
#define DAC0_DAT5H                    (*((volatile uint32_t *)0x4003F00B))      // DAC Data High Register (DAC0_DAT5H)
#define DAC0_DAT6L                    (*((volatile uint32_t *)0x4003F00C))      // DAC Data Low Register (DAC0_DAT6L)
#define DAC0_DAT6H                    (*((volatile uint32_t *)0x4003F00D))      // DAC Data High Register (DAC0_DAT6H)
#define DAC0_DAT7L                    (*((volatile uint32_t *)0x4003F00E))      // DAC Data Low Register (DAC0_DAT7L)
#define DAC0_DAT7H                    (*((volatile uint32_t *)0x4003F00F))      // DAC Data High Register (DAC0_DAT7H)
#define DAC0_DAT8L                    (*((volatile uint32_t *)0x4003F010))      // DAC Data Low Register (DAC0_DAT8L)
#define DAC0_DAT8H                    (*((volatile uint32_t *)0x4003F011))      // DAC Data High Register (DAC0_DAT8H)
#define DAC0_DAT9L                    (*((volatile uint32_t *)0x4003F012))      // DAC Data Low Register (DAC0_DAT9L)
#define DAC0_DAT9H                    (*((volatile uint32_t *)0x4003F013))      // DAC Data High Register (DAC0_DAT9H)
#define DAC0_DAT10L                   (*((volatile uint32_t *)0x4003F014))      // DAC Data Low Register (DAC0_DAT10L)
#define DAC0_DAT10H                   (*((volatile uint32_t *)0x4003F015))      // DAC Data High Register (DAC0_DAT10H)
#define DAC0_DAT11L                   (*((volatile uint32_t *)0x4003F016))      // DAC Data Low Register (DAC0_DAT11L)
#define DAC0_DAT11H                   (*((volatile uint32_t *)0x4003F017))      // DAC Data High Register (DAC0_DAT11H)
#define DAC0_DAT12L                   (*((volatile uint32_t *)0x4003F018))      // DAC Data Low Register (DAC0_DAT12L)
#define DAC0_DAT12H                   (*((volatile uint32_t *)0x4003F019))      // DAC Data High Register (DAC0_DAT12H)
#define DAC0_DAT13L                   (*((volatile uint32_t *)0x4003F01A))      // DAC Data Low Register (DAC0_DAT13L)
#define DAC0_DAT13H                   (*((volatile uint32_t *)0x4003F01B))      // DAC Data High Register (DAC0_DAT13H)
#define DAC0_DAT14L                   (*((volatile uint32_t *)0x4003F01C))      // DAC Data Low Register (DAC0_DAT14L)
#define DAC0_DAT14H                   (*((volatile uint32_t *)0x4003F01D))      // DAC Data High Register (DAC0_DAT14H)
#define DAC0_DAT15L                   (*((volatile uint32_t *)0x4003F01E))      // DAC Data Low Register (DAC0_DAT15L)
#define DAC0_DAT15H                   (*((volatile uint32_t *)0x4003F01F))      // DAC Data High Register (DAC0_DAT15H)
#define DAC0_SR                       (*((volatile uint32_t *)0x4003F020))      // DAC Status Register (DAC0_SR)
#define DAC0_C0                       (*((volatile uint32_t *)0x4003F021))      // DAC Control Register (DAC0_C0)
#define DAC0_C1                       (*((volatile uint32_t *)0x4003F022))      // DAC Control Register 1 (DAC0_C1)
#define DAC0_C2                       (*((volatile uint32_t *)0x4003F023))      // DAC Control Register 2 (DAC0_C2)


//*****************************************************************************
//
// Voltage Reference (VREFV1) registers
//
//*****************************************************************************

#define VREF_TRM                      (*((volatile uint32_t *)0x40074000))      // VREF Trim Register (VREF_TRM)
#define VREF_SC                       (*((volatile uint32_t *)0x40074001))      // VREF Status and Control Register (VREF_SC)


//*****************************************************************************
//
// Programmable Delay Block (PDB) registers
//
//*****************************************************************************

