MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK02FN64VLH10/mcu.h
#define BWI_H                         0x00007F80      // Block Wait Time Integer High (C7816[TTYPE] = 1)
#define BWI_H                         0x00007F80      // Block Wait Time Integer High (C7816[TTYPE] = 1)


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WP7816B_T0 register.
//
//*****************************************************************************

#define WI_L                          0x00007F80      // Wait Time Integer Low (C7816[TTYPE] = 0)
#define WI_L                          0x00007F80      // Wait Time Integer Low (C7816[TTYPE] = 0)


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WP7816B_T1 register.
//
//*****************************************************************************

#define BWI_L                         0x00007F80      // Block Wait Time Integer Low (C7816[TTYPE] = 1)
#define BWI_L                         0x00007F80      // Block Wait Time Integer Low (C7816[TTYPE] = 1)


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WGP7816_T1 register.
//
//*****************************************************************************

#define CWI1                          0x00000780      // Character Wait Time Integer 1 (C7816[TTYPE] = 1)
#define BGI                           0x00000078      // Block Guard Time Integer (C7816[TTYPE] = 1)
#define CWI1                          0x00000780      // Character Wait Time Integer 1 (C7816[TTYPE] = 1)
#define BGI                           0x00000078      // Block Guard Time Integer (C7816[TTYPE] = 1)


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WP7816C_T1 register.
//
//*****************************************************************************

#define Reserved                      0x00000380      // 
#define CWI2                          0x000001F0      // Character Wait Time Integer 2 (C7816[TTYPE] = 1) ::
#define CWI2                          0x00000780      // Character Wait Time Integer 2 (C7816[TTYPE] = 1) ::
#define CWI2                          0x00000780      // Character Wait Time Integer 2 (C7816[TTYPE] = 1)


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDOR register.
//
//*****************************************************************************

#define PDO                           0x7FFFFFFF80000000      // Port Data Output Register bits for unbonded pins return a undefined value when read. 0: Logic level 0 is driven on pin, provided pin is configured for general-purpose output;; 1: Logic level 1 is driven on pin, provided pin is configured for general-purpose output.


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PSOR register.
//
//*****************************************************************************

#define PTSO                          0x7FFFFFFF80000000      // Port Set Output Writing to this register will update the contents of the corresponding bit in the PDOR as follows: 0: Corresponding bit in PDORn does not change;; 1: Corresponding bit in PDORn is set to logic 1.


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PCOR register.
//
//*****************************************************************************

#define PTCO                          0x7FFFFFFF80000000      // Port Clear Output Writing to this register will update the contents of the corresponding bit in the Port Data Output Register (PDOR) as follows: 0: Corresponding bit in PDORn does not change;; 1: Corresponding bit in PDORn is cleared to logic 0.


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PTOR register.
//
//*****************************************************************************

#define PTTO                          0x7FFFFFFF80000000      // Port Toggle Output Writing to this register will update the contents of the corresponding bit in the PDOR as follows: 0: Corresponding bit in PDORn does not change;; 1: Corresponding bit in PDORn is set to the inverse of its existing logic state.


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDIR register.
//
//*****************************************************************************

#define PDI                           0x7FFFFFFF80000000      // Port Data Input Reads 0 at the unimplemented pins for a particular device. Pins that are not configured for a digital function read 0. If the Port Control and Interrupt module is disabled, then the corresponding bit in PDIR does not update. 0: Pin logic level is logic 0, or is not configured for use by digital function;; 1: Pin logic level is logic 1.


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDDR register.
//
//*****************************************************************************

#define PDD                           0x7FFFFFFF80000000      // Port Data Direction Configures individual port pins for input or output. 0: Pin is configured as general-purpose input, for the GPIO function;; 1: Pin is configured as general-purpose output, for the GPIO function.


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define EREFSTEN                      0x00000020      // Enable External Reference Clock for Startup
#define SC2P                          0x00000008      // System Clock Divider 2 Prescaler
#define SC4P                          0x00000004      // System Clock Divider 4 Prescaler
#define SC8P                          0x00000002      // System Clock Divider 8 Prescaler
#define SC16P                         0x00000001      // System Clock Divider 16 Prescaler



#endif // __MK02FN64VLH10_H__

